{
    "DateTime": "2023-12-27 14:41:39",
    "URL": "https://support.timextender.com/semantic-model-109/ssas-perspectives-1055",
    "Keywords": "missing",
    "Title": "SSAS Perspectives _ Community",
    "Author": "Christian Hauggaard",
    "Text": "Note: Tabular endpoints Tabular models can become complex with numerous tables, fields, and measures, making it challenging for users of analysis and visualization tools to maintain an overview and quickly locate specific objects they need. To address this, SSAS Perspectives are introduced as a subset of objects within a tabular model that users of tools like Power BI, Excel, and others can apply to simplify their interaction with the model.  A SSAS perspective represents a focused subset of objects in a tabular model that relates to a specific area. For instance, you can create a \"finance\" SSAS perspective that includes all objects related to finance. When this perspective is utilized in front-end tools, any objects outside this subset will be hidden, providing a streamlined view for users. Semantic Model Manage Perspectives Click on Add in the Perspectives window to create a new perspective. Double-click the Perspective header to rename it, e.g., \"Finance Model\". Select the checkboxes for the objects you want to include in the perspective. Note that when all objects in a table are selected, the table is marked with a checkmark. If only some objects are selected, the table is marked with a dot. Click OK after selecting the objects. Deploy and execute the semantic model for the SSAS perspective to take effect. Get Data > From Analysis Services OK Get Data > From Analysis Services Finish  Browse OK Error: To resolve this error, ensure that a measure is selected in the SSAS perspective. No perspectives when deploying tabular model | Community (timextender.com) @Thomas Lind  P.S.  If you try to create perspectives in the GUI, with a local standard edition sql server, it will deploy without problems. Maybe a warning should be put in place here to indicate that it cannot create the perspectives due to environment constraints. ",
    "Lists": []
}