{
    "DateTime": "2023-12-27 14:40:09",
    "URL": "https://support.timextender.com/odx-107/manual-migration-of-business-unit-to-odx-1493",
    "Keywords": "missing",
    "Title": "Manual Migration of Business Unit to ODX _ Community",
    "Author": "Greg Lennox",
    "Text": "TimeXtender Version 20.10 allowsfor the configuration of the Operation Data Exchange (ODX) as well as the legacyBusiness Units functionality for data sources. Subsequent versions of TimeXtender have deprecated Business Units in favor of the more robust ODX service. TimeXtender is currently developing a migration tool to assist users in migrating their Business Units into ODX data sources and data areas. Until the migration tool is available, however, there may be instances where users may want to perform a manual migration of business units over to the ODX.This article clarifies the steps needed to accomplish this migration.  High level steps: Tips to simplify the manual migration process: Depending on the type of business unit data source, you may be able to copy the connection string and then import that connection string into the ODX data source, which can be particularly helpful withCData data sources as shown in the following example.       Once you have setup the data sources, and executed the ODX transfer tasks, compare the data in the ODX storage and BU databases to see if the data is the same. One crucial difference between Business Unit and ODX, is that some transformations that exist in a BU cannot be done in ODX for example, conditional lookup fields. These transformations need to be moved to the DSA. If there are a lot of transformations that need to be moved to the DSA, there are two options: When remapping the data sources, endeavor to ensure that the ODX field names match the field names that arein the data warehouse, andconsider using Query Tables to rename the fields as needed. Manage Query Tables Smart Synchronize Smart Synchronize with table <tablename> As an additional tip: using the View > Uneven Mappings feature will allow you to quickly see if all mappings are covered or whether some fields only have one mapping. ",
    "Lists": []
}