{
    "DateTime": "2023-12-27 14:41:37",
    "URL": "https://support.timextender.com/semantic-model-109/qlik-endpoint-1042",
    "Keywords": "missing",
    "Title": "Qlik Endpoint _ Community",
    "Author": "Christian Hauggaard",
    "Text": "semantic model instance Note:  Microsoft OLE DB Driver for SQL Server Data Estate Instances, Add Instance> Add semantic model instance Add endpoints Add an endpoint Fill out the following fields in the form. Enforce unique field names No View schema Postfix App prefix Qlik application QlikSense Enterprise Server Settings Qlik Sense Desktop QlikView QlikSense app type App for generating QVD file: QVD folder QVD folder App for displaying data: Deploy Qlik script to text file File path Server Settings Protocol HTTPS Hostname Port Timeout Terminate execution when timeout is reached Authentication Use proxy authentication Username Password Virtual proxy prefix Use certificate authentication Username Certificate Certificate password Data for the QVD files is extracted from views. On deployment, a view for each table in the model is created in the data warehouse or staging database that house the table. The view name depends on the settings on the endpoint and has the format [view schema].[table name]_[postfix], e.g. \"QView.Customers_QV\". Apart from creating the views, deployment is different depending on your choice of Qlik application: Qlik Sense Enterprise QlikSense Desktop Create Qlik Sense App QlikView QlikView Scripts ContentAdmin The user also needs rights to create files in a folder if you use QVD files. In this case for the svc_qlik user as well. You can create your own proxy to connect to and the things you need to set up are these. It needs a unique Description name with no blank spaces, a unique Session cookie header name and the load balancing needs to point to the server node. It also needs to be associated by the proxy server. Though as standard the default one can be used if TimeXtender is to be used on the same server. Add machine name Export Certificates There are some services that are running. The user that runs the engine service needs read rights on the DWH table. Lastly the server name cannot be localhost and ., it needs to be the host name instead. It is really important that the server name and name of the DWH database you connect to are in the same case, if it is all in lowercase the connection will fail. You can always find the correct server name in this location in management studio.   It is very important that you add the correct host name and that it is the same case as what is in the system setup. So while the virtual machine name is one thing, the actual computers name is different. It is also necessary that the host name is in the same case setting as it is in the system menu. When you set it up, you use the correct protocol, add the server name, the port, the virtual proxy you made and the account you want to run as. Virtual proxy prefix The setup needs a port, a user account, the certificate that was exported and the password you gave it. Port 4747 is default. ",
    "Lists": [
        {
            "heading": "Qlik endpoint menu",
            "paragraphs": [
                "In the TimeXtender Portal navigate to Data Estate > Instances, click Add Instance> Add semantic model instance. Select Qlik Endpoint from the Add endpoints list, then click Add an endpoint.",
                "Fill out the following fields in the form."
            ],
            "list": [
                "(Optional) In the Enforce unique field names list, click on No if you don't want TimeXtender to ensure that field names are always unique across tables by prefixing the name with the table name on deployment.",
                "(Optional) In the View schema box, type the schema name you want to use for the views generated by TimeXtender.",
                "(Optional) In Postfix box, type the postfix TimeXtender uses for views, folder names etc.",
                "(Optional) In the App prefix box, type a string to be prefixed to the endpoint name to create the app name used in Qlik Sense.",
                "In the Qlik application list, click on the Qlik application to target. You have the following options:  Qlik Sense Enterprise: Use a Qlik Sense Enterprise server. When you chose this application type, you need to enter server connection information under Server Settings.   Qlik Sense Desktop   QlikView",
                "Qlik Sense Enterprise: Use a Qlik Sense Enterprise server. When you chose this application type, you need to enter server connection information under Server Settings.",
                "Qlik Sense Desktop",
                "QlikView",
                "If you are deploying to Qlik Sense Enterprise or Qlik Sense Desktop, click on the app type you want to create in the Qlik Sense app type list. You have the following options:  App for generating QVD file: Creates an app that generates a QVD file with data from the model in the QVD folder you specify. The QVD folder should accessible for both TimeXtender and Qlik Enterprise.   App for displaying data: Creates an app and loads data from the model into it.",
                "App for generating QVD file: Creates an app that generates a QVD file with data from the model in the QVD folder you specify. The QVD folder should accessible for both TimeXtender and Qlik Enterprise.",
                "App for displaying data: Creates an app and loads data from the model into it.",
                "Select Deploy Qlik script to text file and enter a path in File path to have TimeXtender output the script it generates to a text file.",
                "If you are deploying to Qlik Sense Enterprise, enter settings under Server Settings:  In the Protocol list, click on HTTPS if your server uses a secure HTTP connection.   Type your server's hostname in the Hostname box.   Type the port to connect to in the Port box if it is different from the default. The defaults are 4747 if you use certificate authentication, 80 if you use proxy authentication with HTTP and 443 if you use proxy authentication with HTTPS.   (Optional) In the Timeout box, enter the timeout you want to use in communication with the server.   Select Terminate execution when timeout is reached if you want TimeXtender to terminate - kill - an execution when the timeout is reached. This is useful in rare cases where executions will not terminate by themselves.   In the Authentication list, select the method you are using to authenticate with the Qlik Sense Enterprise server.  Click Use proxy authentication if you are using the proxy authentication method to authenticate with the Qlik Sense Enterprise server. Type your username in the Username box and your password in the Password box. Write the prefix from the virtual proxy in Qlik Sense in the Virtual proxy prefix box.   Click Use certificate authentication if you are using the certificate authentication method for authenticating with Qlik. Type your username in the Username box, enter the path to the certificate in the Certificate path box, and the associated password in the Certificate password box.",
                "In the Protocol list, click on HTTPS if your server uses a secure HTTP connection.",
                "Type your server's hostname in the Hostname box.",
                "Type the port to connect to in the Port box if it is different from the default. The defaults are 4747 if you use certificate authentication, 80 if you use proxy authentication with HTTP and 443 if you use proxy authentication with HTTPS.",
                "(Optional) In the Timeout box, enter the timeout you want to use in communication with the server.",
                "Select Terminate execution when timeout is reached if you want TimeXtender to terminate - kill - an execution when the timeout is reached. This is useful in rare cases where executions will not terminate by themselves.",
                "In the Authentication list, select the method you are using to authenticate with the Qlik Sense Enterprise server.  Click Use proxy authentication if you are using the proxy authentication method to authenticate with the Qlik Sense Enterprise server. Type your username in the Username box and your password in the Password box. Write the prefix from the virtual proxy in Qlik Sense in the Virtual proxy prefix box.   Click Use certificate authentication if you are using the certificate authentication method for authenticating with Qlik. Type your username in the Username box, enter the path to the certificate in the Certificate path box, and the associated password in the Certificate password box.",
                "Click Use proxy authentication if you are using the proxy authentication method to authenticate with the Qlik Sense Enterprise server. Type your username in the Username box and your password in the Password box. Write the prefix from the virtual proxy in Qlik Sense in the Virtual proxy prefix box.",
                "Click Use certificate authentication if you are using the certificate authentication method for authenticating with Qlik. Type your username in the Username box, enter the path to the certificate in the Certificate path box, and the associated password in the Certificate password box."
            ]
        },
        {
            "heading": "Qlik application types",
            "paragraphs": [
                "Apart from creating the views, deployment is different depending on your choice of Qlik application:"
            ],
            "list": [
                "Qlik Sense Enterprise: An app called \"[Endpoint name]_QVDApp\" is created on the server. Unlike the other Qlik applications, Qlik Sense Enterprise has an execution step. On execution, the app on the server is executed and creates QVD files on the file path specified.",
                "Qlik Sense Desktop: You can right-click the endpoint and click Create Qlik Sense App to create an app in the application. When you execute this app in Qlik Sense Desktop, it creates QVD files based on the tables in the semantic model on the file path you have specified.",
                "QlikView: You can right-click the endpoint and click QlikView Scripts to show and copy the script you need to use in QlikView to generate QVD files based on the tables in the semantic model."
            ]
        }
    ]
}