{
    "DateTime": "2023-12-27 14:42:40",
    "URL": "https://support.timextender.com/data-sources-112/connect-to-csv-data-sources-732",
    "Keywords": "missing",
    "Title": "Connect to CSV data sources _ Community",
    "Author": "Thomas Lind",
    "Text": "Add a CData data source Here is a link to the file I use in this example http://mysafeinfo.com/api/data?list=moviesbyearnings2005&format=csv It is set up with elements like this. Add a data source, search for CSV and choose this provider. CSV guide from CData You can save the link in the CSV Information area as something csv and save it in a folder your user has rights to. Data Source You can then set it up like this. Row Scan Depth It is now by default this is set to 0, it used to be 100. If it is 100 it meant that it would define the data types by reading the first 100 rows. The new default of 0 means that it is a indefinite number, then it will read the whole file before determining the fields data types. If your file is very large it can take a lot of time to synchronize and here setting it to 10000 is better. URI C:\\FlatFiles\\TESTCSVFTP You can also point to files across many folders. You need to be sure the following features are turned on. Include Subdirectories True Directory Retrieval Depth -1 You also have the option of connecting to a FTP server that contains CSV files. The connection string is as follows. I have a FTP server with a folder that contains some CSV files and here is how I set it up. Password User URI 21 SFTP There are more methods to connect to Blob store containers and File Shares, but the one will work with not much setup. Auth Scheme  AzureAD Your myfilesystem is the name of the container and the remotePath is the name of the folder Important:  abfss:// URI I have a container called sharedfiles and a file there with the name applied. Your mycontainer is the name of the container and the myblob is the foldername. For both methods what comes after the // is the same. First is the container name, then the folders and finally the file. Though you can choose to point at only the folder if you want. azurefile://  Here are some of the common issues you can experience and how to resolve these issues. As long as it is comma separated, this is all you need. If it is not comma separated there are two options. There are two fields you can use to change the default settings. FMT CsvDelimited Link | When synchronized it will search for this field to base the fields on. Row Delimiter So if your file doesn't use CR LF as the row delimiter, you can add it here. A feature of CSV is the option to aggregate files in a folder into one. I have this folder with some files that contain data from a specified month. Other than that they are exactly the same. It is the same folder I pointed at in the section regarding connection to multiple files. For this to work it is important that they have the exact same field names in all of the files. Aggregate Files URI: FTP SFTP Aggregate Files True Row Scan Depth 10000 AggregatedFiles It contains data from all 10 files with the URI field showing the file name. It can be that you have more than one file type in the folder you do aggregates at, for example some files with a date part of their names, but also files that do not contain the same fields and data types. Include Files Include Files: Order*.csv Include Subdirectories If you cannot control that the field names are always the same, you can set it to ignore the field names and skip the 1st row in each file. Include Column Headers Skip Top -1 The above settings will give this. Where all field names is called Col1 and so forth. The provider attempts to detect data types, but sometimes it may run into errors. There are a few workarounds for quick data extraction: Sometimes your datetime fields will have added or subtracted hours. This is due to it being converted to your timezone. The CData provider expects all dates will come in UTC and add hours according to the settings on your computer. It even knows about summertime. If you do not want this to happen, you need to add this to the other field ConvertDateTimeToGMT If your CSV file is in a specific encoding, you can convert it by adding this to the field. Charset=UTF-16 UTF-8 Culture Client Culture here nl-NL Client Culture en-US  Culture  @Thomas Lind @Thomas Lind Obviouslly these setups in the portal based data sources configuration. @rvgfox You need an app registration that has rights to the SharePoint you connect to. You do not need to state the SharePoint URL unless the file is located in a specific site, otherwise it will use the default, which is known by the app, it seems. connection type Sharepoint Rest URI sprest://folder/file.csv So in the above, I point to a file that is located in the following folders. Storage Base URL So if you see this The URI would be sprest://Exported/c Include files PEC_Nicor_Gardens_*.txt Aggregate Files Excel guide @Thomas Lind Obviouslly these setups in the portal based data sources configuration. @rvgfox I needed to update this, as it is explained in this section.   @Thomas Lind but how is the setup if the multiple files are in one folder on the ODX server machine (example C:XTXT).   @rvgfox You keep saying the same thing and I will share the same link again. Can you maybe explain how the above is not helping you? ",
    "Lists": [
        {
            "heading": "Troubleshooting data types",
            "paragraphs": [
                "The provider attempts to detect data types, but sometimes it may run into errors.  There are a few workarounds for quick data extraction:"
            ],
            "list": [
                "Generate a RSD file and change the field types manually to override specific data types.",
                "Set Type Detection Scheme = “None” in the provider setup dialog options. This will bring all data as string type (varchar). You may convert it later to other types as needed. This technique may work in any CData provider which exposes Type Detection Scheme property.",
                "This will bring all data as string type (varchar). You may convert it later to other types as needed.",
                "This technique may work in any CData provider which exposes Type Detection Scheme property."
            ]
        }
    ]
}