{
    "DateTime": "2023-12-27 14:41:58",
    "URL": "https://support.timextender.com/executions-jobs-110/scheduling-executions-using-jobs-722",
    "Keywords": "missing",
    "Title": "Scheduling Executions using Jobs _ Community",
    "Author": "Christian Hauggaard",
    "Text": "TimeXtender 6024.1 On-Demand Data Warehouse Ingestion TimeXtender 6134.1 Jobs are used to schedule executions for ODX, Data Warehouse, and Semantic Model instances. For ODX instances, jobs are used to schedule synchronization, transfer, and storage management tasks. For Data Warehouse and Semantic Model instances, jobs are used to schedule execution packages. Configure theTimeXtender Execution Service Open Execution Execution packages Add Execution Package. Open Execution Execution packages Add Execution Package. An execution package determines which objects in an instance will be executed and how. The following window shows setup options for an execution package in a Data Warehouse instance. The following window shows setup options for an execution package in a Semantic Model instance. To setup an execution package, follow the steps below. Jobs Add Job Next Note_Only tasks relating to one ODX instance can be added to a job. In other words, tasks from different ODX instances cannot be added to the same job. Furthermore, a job can contain either execution packages or ODX tasks, not both in one job.  Schedule   Right-click on the job,to edit or delete it. Manage Schedule Right-click on the job to view the execution log for the job. Use the date, status and severity filters to search through the execution log for the job. Jobs Monitor The Job Monitor shows if a job is valid, the state of the job, its execution state, and the last execution date. A job will be shown as invalid if the Execution Server Configuration has not been setup for the instances related to the job. When a job is run, the state of the job will change from Idle to Active, and the execution state will then change to Running and, once done, to Completed. Notifications can be used to alert specified individuals when the execution package was successfully run or in case something caused it to fail. Notifications are most commonly set up as email alerts, but can be saved to the Event Log as well.  Mail.Send, SMTP.Send and User.Read Admin grant consent without Multi-factor Authentication The notification can now be selected when you create an execution package. You can choose what objects to prioritize during a managed execution. This is useful if you, for instance, only have a small timeslot for extracting data from a source, or If you would like to have a certain cube ready for the users as early as possible during execution. To set up a new prioritization for use in an execution package, follow the steps below. If you want to execute an execution package only under certain conditions, you can add a usage condition to the execution package. To add a usage condition to an execution package, follow the steps below. If you try to manually execute a package with a usage condition that evaluates to \"true\", a warning message will pop up. The same message will be written to the log if you try to execute the package in a scheduled execution. Warning: Data on demand Advanced Settings 1. On TX Desktop, edit your data source Advanced Settings Data on demand  Whats do the option Log Row Count? @rvgfox With the log row countoptionenabled in an execution package, you can see the row count on an individual table by execution (for that particular execution package). This can be seen by right-clicking on the table and selecting View Execution Overview Log. Then select Raw Rows under Measures Which will show the following: You can also see which execution package that the data was logged from in the lower left corner under the Logs section. Data on demand   @rvgfox  @Jan Stroeve or  On-Demand data warehouse ingestion How do I temporarily disables jobs from running, without deleting them? @Bitmetric_Maarten There is no way to specifically stop a job from running on a set time, but you can always remove or change the start times to be only run once earlier on the current day. Hi Thomas. Thats unfortunate, since we would like to keep these jobs running continuously on the production server. But, sometimes also the PRD server needs changes or updates and these could/will interfere with the jobs running. I saw the request also mention on the ideas page. Is it part of the roadmap? ",
    "Lists": [
        {
            "heading": "Configuring an Execution Package",
            "paragraphs": [
                "An execution package determines which objects in an instance will be executed and how.",
                "The following window shows setup options for an execution package in a Data Warehouse instance.",
                "The following window shows setup options for an execution package in a Semantic Model instance.",
                "To setup an execution package, follow the steps below."
            ],
            "list": [
                "Type a Name for the execution package.",
                "In the Include/Exclude Steps tab, choose the steps you want to include in or exclude from the execution package by dragging objects from All Steps to Include Steps or Exclude Steps, respectively. For example, simply drag the Execute Instance step to Included Steps if you want to execute the entire instance when the package is executed. If you want to exclude the entire instance except for one or more steps, simply drag those steps to Exclude Steps. Right-click an object and click Remove Step to remove a step from the Include Steps or Exclude Steps.",
                "(Optional) On the Concurrent packages tab, select the other packages that can execute concurrently with the package you are adding. By default, two packages from the same instance will not run at the same time unless you explicitly allow them to. Note: When you set package \"A\" to be able to execute concurrently with package \"B\", package \"B\" will also be set to be able to execute concurrently with package \"A\". In other words, if you want to be able to execute \"A\" when \"B\" is already running, you cannot use this functionality to prevent \"B\" from being run when \"A\" is already running.",
                "Note: When you set package \"A\" to be able to execute concurrently with package \"B\", package \"B\" will also be set to be able to execute concurrently with package \"A\". In other words, if you want to be able to execute \"A\" when \"B\" is already running, you cannot use this functionality to prevent \"B\" from being run when \"A\" is already running.",
                "Enter the maximum number of steps that can run in parallel during execution in Max. Threads. The optimal number of threads depends on server resources. Too few threads mean slower than necessary execution times, while too many threads can cause the server to become slow or unresponsive.",
                "Clear the Log Execution time and/or the Log Row Count check boxes if you do not want to log this information. Note: the Log Row Count option is only available for Data Warehouse instances.",
                "Select a setting for Managed Execution. You have the following options:  Disabled: Managed execution is disabled. Objects will be executed in the order they are listed in the tree. Warning: If you disable managed execution, tables are executed in the order in which they appear in the tree. To avoid errors during execution, you must ensure that tables are executed in a logical order. For example, an Order table must be executed before the related Order Detail table. Tables can be moved up and down the tree using drag-and-drop or the keyboard combination Alt+Up/Down. Execution Number: When more than one object is ready to execute, TimeXtender prioritizes the objects based on their position in the tree from top to bottom.Classification: When more than one object is ready to execute, TimeXtender prioritizes the objects based on their table classification. The order will be “Fact Table – Large”, “Fact Table”, “Dimension Table – Large”, and “Dimension Table”. If two tables have the same classification TimeXtender will use the execution number as the secondary criteria. Execution Time: When more than one object is ready to executed, TimeXtender prioritizes the objects based on their average execution time so that the object with the longest execution time is executed first. If two tables have the same execution time (e.g. in case of new objects), TimeXtender will use the execution number as the secondary criteria. When execution time of the objects in the instance are known, this option will result in the shortest execution time in most cases.",
                "Disabled: Managed execution is disabled. Objects will be executed in the order they are listed in the tree.",
                "Warning: If you disable managed execution, tables are executed in the order in which they appear in the tree. To avoid errors during execution, you must ensure that tables are executed in a logical order. For example, an Order table must be executed before the related Order Detail table. Tables can be moved up and down the tree using drag-and-drop or the keyboard combination Alt+Up/Down.",
                "Execution Number: When more than one object is ready to execute, TimeXtender prioritizes the objects based on their position in the tree from top to bottom.Classification: When more than one object is ready to execute, TimeXtender prioritizes the objects based on their table classification. The order will be “Fact Table – Large”, “Fact Table”, “Dimension Table – Large”, and “Dimension Table”. If two tables have the same classification TimeXtender will use the execution number as the secondary criteria.",
                "Execution Time: When more than one object is ready to executed, TimeXtender prioritizes the objects based on their average execution time so that the object with the longest execution time is executed first. If two tables have the same execution time (e.g. in case of new objects), TimeXtender will use the execution number as the secondary criteria. When execution time of the objects in the instance are known, this option will result in the shortest execution time in most cases.",
                "Check Merge Steps if you want to treat all individual sub-steps of the chosen steps as one big collection. This can speed up execution.",
                "(Optional) In the Prioritization list, click the prioritization you want the execution package to use. For more information on prioritization, see the Adding a Prioritization section below.",
                "Under Failure Handling, select what Action TimeXtender should perform if the execution fails. You have the following options:  Fail Package: When a step fails, the execution is stopped and the package is declared failed.  Retry Step: When a step fails, the step will be retried until the maximum number of retries for the entire package or the individual step is reached. Enter the maximum number of retries allowed for the package in the Retries box and the maximum number of retries allowed for an individual package in Retries per Step. Enter the amount of time to wait between retries in Retry delay in minutes. For more information on retries, see Setting up retry steps.",
                "Fail Package: When a step fails, the execution is stopped and the package is declared failed.",
                "Retry Step: When a step fails, the step will be retried until the maximum number of retries for the entire package or the individual step is reached. Enter the maximum number of retries allowed for the package in the Retries box and the maximum number of retries allowed for an individual package in Retries per Step. Enter the amount of time to wait between retries in Retry delay in minutes. For more information on retries, see Setting up retry steps.",
                "Under Post Execution, select a Notification on Success and a Notification on Failure. You have to create a notification before it is available from the list. See the Adding Notifications section below.",
                "If you want to run another package after a successful execution, select the next package to run under Run Package.",
                "Click OK to add the execution package."
            ]
        },
        {
            "heading": "Adding a Notification for an Execution Package",
            "paragraphs": [
                "Notifications can be used to alert specified individuals when the execution package was successfully run or in case something caused it to fail. Notifications are most commonly set up as email alerts, but can be saved to the Event Log as well."
            ],
            "list": [
                "On the Execution tab, right-click Notifications, and click Add Notification. The Notification window appears.",
                "Enter a Name for the notification and select the Type of notification you want to create. You have the following options: Option Description Mail Creates an email notification EventLog Writes a notification to the event log Both Creates both an email notification and writes to the event log",
                "Enter the information for the SMTP server you want to use under Mail Server. Since October 1st, 2022 Microsoft has ended basic authentication on email on online SMTP servers. To deal with this you need to add an Application (client) id for an app to use for this and the Tenant ID for your company. The app you use needs the following permissions.     You need the three options, (Mail.Send, SMTP.Send and User.Read) set on your app   You need a Admin to grant consent for the three settings.   The user account you add as the From Email and the User name needs to run without Multi-factor Authentication.   If you use GMail to authenticate, it is not possible to use email and an std password. Here you need to turn on 2-step authentication for your email account and then use the App Password in the password field.",
                "Since October 1st, 2022 Microsoft has ended basic authentication on email on online SMTP servers. To deal with this you need to add an Application (client) id for an app to use for this and the Tenant ID for your company. The app you use needs the following permissions.     You need the three options, (Mail.Send, SMTP.Send and User.Read) set on your app   You need a Admin to grant consent for the three settings.   The user account you add as the From Email and the User name needs to run without Multi-factor Authentication.",
                "You need the three options, (Mail.Send, SMTP.Send and User.Read) set on your app",
                "You need a Admin to grant consent for the three settings.",
                "The user account you add as the From Email and the User name needs to run without Multi-factor Authentication.",
                "If you use GMail to authenticate, it is not possible to use email and an std password. Here you need to turn on 2-step authentication for your email account and then use the App Password in the password field.",
                "Enter the email addresses of the recipients and a Subject under Mail Recipient. In the subject, you can use the following variables: %Instance%: The name of the instance. %Status%: The status of the execution (Success / Fail). %ExecutionPackage%: The name of the execution package.",
                "%Instance%: The name of the instance.",
                "%Status%: The status of the execution (Success / Fail).",
                "%ExecutionPackage%: The name of the execution package.",
                "Click OK."
            ]
        },
        {
            "heading": "Adding a Prioritization to an Execution Package",
            "paragraphs": [
                "You can choose what objects to prioritize during a managed execution. This is useful if you, for instance, only have a small timeslot for extracting data from a source, or If you would like to have a certain cube ready for the users as early as possible during execution.",
                "To set up a new prioritization for use in an execution package, follow the steps below."
            ],
            "list": [
                "On the Execution tab, right-click Prioritizations and click Add Prioritization. The Add Prioritization window opens.",
                "In Name, type a name for the prioritization.",
                "Drag and drop an object from the Available Objects tree to Selected Objects to add this object to prioritized objects.",
                "Click an object in the Selected Objects list to have the execution steps for that object displayed under Object Settings. Select or clear the individual steps under Selected steps to configure what steps will be prioritized in the execution. For instance, you might only want to prioritize the transfer of data from a specific table because your priority is to have the transfer completed as soon as possible.",
                "Select Blocking if you want the execution to halt all other execution tasks until the selected steps for the selected object have been completed.",
                "Click OK to close the window and create the new prioritization."
            ]
        },
        {
            "heading": "Adding a Usage Condition to an Execution Package",
            "paragraphs": [
                "If you want to execute an execution package only under certain conditions, you can add a usage condition to the execution package. To add a usage condition to an execution package, follow the steps below."
            ],
            "list": [
                "Right-click on the instance, and select Instance Variables, to add the instance variable you want to use in your usage condition.",
                "On the Execution tab, expand Execution Packages, right-click the relevant execution package, and click Add Usage Condition. The Usage Condition pane appears on the right-hand side.",
                "The available instance variables are listed in the window. Click the variable you want to use.",
                "In the Operator list, click the operator you want to use.",
                "In the Comparer list, click the data type you want to use when comparing the variable to the value.",
                "In the Value box, type the value you want to compare the variable against.",
                "Click Add to add the usage condition."
            ]
        }
    ]
}