{
    "DateTime": "2023-12-27 14:42:26",
    "URL": "https://support.timextender.com/data-sources-112/cdata-providers-performance-optimization-and-troubleshooting-868",
    "Keywords": "missing",
    "Title": "CData Providers  - Performance Optimization and Troubleshooting _ Community",
    "Author": "missing",
    "Text": "This article describes general techniques to optimize performance of CData Providers and to troubleshoot errors or unexpected behavior during data extraction. For specific provider-related techniques, refer to the provider documentation. A CData providersperformance is largely dependent on the data source and the amount of data. Decreasing the amount of data retrieved will improve performance. Queries with multiple joins, many columns, large number of rows, etc. take longer. filters Logfiles can be generated by setting two properties: 3 1 Verbosity Levels: Note: Verbosity levels 3 and higher can capture sensitive client data, including: masks sensitive values The provider version can be obtained from the log file. It is printed out whenever a connection is opened. For example: Version version error message stack trace CData class query order request format data response errors data INFO|Connec Every CData provider has a major and minor version: i.e., 22.0.8413 EXEC Parsed HTTP Req HTTP Res: 0 The response can be used to determine if missing data was returned by the API. It may also contain a more detailed error message. InitiateOAuth   OAuthSettingsLocation   per user OAuthSettingsLocation 400 (Bad Request)  external tool Postman URL Header. Timeouts can occur because of the Timeout connection property or due to the data source. Timeout 0 timestamps Review  Timeouts on databases  for more details on timeout issues. ",
    "Lists": [
        {
            "heading": "Properties related to performance:",
            "paragraphs": [],
            "list": [
                "MaxRows - limits the number of rows returned when no aggregation or group by is used in the query",
                "Verbosity - decreasing the verbosity level will reduce the amount of log writing",
                "PageSize - affects the maximum number of results to return per page; If you get an error asking to request less data, set PageSize to a lower value.",
                "BatchSize - useful when the server has limitations on the size of the request that can be submitted",
                "Disable PseudoColumns / CustomFields to decrease the request size"
            ]
        },
        {
            "heading": "Generating Logs",
            "paragraphs": [
                "Logfiles can be generated by setting two properties:"
            ],
            "list": [
                "Logfile – set to a file path and file name (for example,    Logfile='C:\\Logs\\REST_Log.txt')",
                "Verbosity – set to a number between 1 and 5 (for example,    Verbosity=3)"
            ]
        },
        {
            "heading": "Reviewing Logs",
            "paragraphs": [
                "[INFO|Connec] lines contain information on the provider used, the version, the edition, and the connection string",
                "Every CData provider has a major and minor version: i.e., 22.0.8413"
            ],
            "list": [
                "22 – Major version, updated every year 8413 – Minor version, updated with daily builds",
                "22 – Major version, updated every year",
                "8413 – Minor version, updated with daily builds"
            ]
        }
    ]
}